gicking/STM8_headers/SVD/STM8S208C8.svd
      </registers>
      <interrupt>
        <name>UART3_T_TC</name>
        <description>UART3_T_TC interrupt</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>UART3_T_TXE</name>
        <description>UART3_T_TXE interrupt</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>UART3_R_IDLE</name>
        <description>UART3_R_IDLE interrupt</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>UART3_R_LBDF</name>
        <description>UART3_R_LBDF interrupt</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>UART3_R_LHDF</name>
        <description>UART3_R_LHDF interrupt</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>UART3_R_OR</name>
        <description>UART3_R_OR interrupt</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>UART3_R_PE</name>
        <description>UART3_R_PE interrupt</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>UART3_R_RXNE</name>
        <description>UART3_R_RXNE interrupt</description>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>WWDG</name>
      <baseAddress>0x50D1</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0002</size>
        <usage>registers</usage>
      </addressBlock>
      <description>WWDG</description>
      <groupName>Watchdog</groupName>
      <registers>
        <register>
          <name>CR</name>
          <description>WWDG control register</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x7F</resetValue>
          <fields>
            <field>
              <name>T0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDGA</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WR</name>
          <description>WWDR window register</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x7F</resetValue>
          <fields>
            <field>
              <name>W0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>W1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>W2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>W3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>W4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>W5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>W6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CAN</name>
      <baseAddress>0x5420</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0018</size>
        <usage>registers</usage>
      </addressBlock>
      <description>CAN</description>
      <groupName>CAN</groupName>
      <registers>
        <register>
          <name>MCR</name>
          <description>CAN master control register</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x02</resetValue>
          <fields>
            <field>
              <name>INRQ</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLEEP</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFP</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFLM</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NART</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWUM</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABOM</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TTOM</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MSR</name>
          <description>CAN master status register</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x02</resetValue>
          <fields>
            <field>
              <name>INAK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLAK</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRI</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUI</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSR</name>
          <description>CAN transmit status register</description>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>RQCP0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RQCP1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RQCP2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXQOK0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXQOK1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXQOK2</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR</name>
          <description>CAN transmit priority register</description>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x0C</resetValue>
          <fields>
            <field>
              <name>CODE0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CODE1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TME0</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TME1</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TME2</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOW0</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOW1</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOW2</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RFR</name>
          <description>CAN receive FIFO register</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>FMP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FULL</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FOVR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFOM</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>CAN interrupt enable register</description>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>TMEIE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMPIE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FFIE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FOVIE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUIE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DGR</name>
          <description>CAN diagnosis register</description>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0x0C</resetValue>
          <fields>
            <field>
              <name>LBKM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SILM</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAMP</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RX</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXM2E</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FPSR</name>
          <description>CAN page selection register</description>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>P0</name>
          <description>CAN paged register 0</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>P1</name>
          <description>CAN paged register 1</description>
          <addressOffset>0x0009</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>P2</name>
          <description>CAN paged register 2</description>
          <addressOffset>0x000A</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>P3</name>
          <description>CAN paged register 3</description>
          <addressOffset>0x000B</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>P4</name>
          <description>CAN paged register 4</description>
          <addressOffset>0x000C</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>P5</name>
          <description>CAN paged register 5</description>
          <addressOffset>0x000D</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>P6</name>
          <description>CAN paged register 6</description>
          <addressOffset>0x000E</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>P7</name>
          <description>CAN paged register 7</description>
          <addressOffset>0x000F</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>P8</name>
          <description>CAN paged register 8</description>
          <addressOffset>0x0010</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>P9</name>
          <description>CAN paged register 9</description>
          <addressOffset>0x0011</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PA</name>
          <description>CAN paged register A</description>
          <addressOffset>0x0012</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PB</name>
          <description>CAN paged register B</description>
          <addressOffset>0x0013</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PC</name>
          <description>CAN paged register C</description>
          <addressOffset>0x0014</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PD</name>
          <description>CAN paged register D</description>
          <addressOffset>0x0015</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PE</name>
          <description>CAN paged register E</description>
          <addressOffset>0x0016</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
        <register>
          <name>PF</name>
          <description>CAN paged register F</description>
          <addressOffset>0x0017</addressOffset>
          <resetValue>0x00</resetValue>
        </register>
